Revit 2027 API
AssetPropertyDoubleArray3d.IsValidValue Method
 Checks that the value is a valid value for this property.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidValue(
	XYZ xyz
)
Public Function IsValidValue (
	xyz As XYZ
) As Boolean
public:
bool IsValidValue(
	XYZ^ xyz
)
member IsValidValue :
        xyz : XYZ -> bool
Parameters
xyz XYZ
 The value to be checked.
Return Value
Boolean
 True if the value is valid for the property.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Cannot check validity for a property not being edited in AppearanceAssetEditScope.
See Also
Reference
AssetPropertyDoubleArray3d Class
Autodesk.Revit.DB.Visual Namespace